pressure_tests_results/with_redis_random_files_1.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 383 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 823 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1275 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1700 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2145 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2590 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 3031 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3479 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3918 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4348 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4769 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5220 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5664 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6111 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6548 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6993 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7420 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7844 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8295 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8723 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8776 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 91 MB/s
     data_sent......................: 1.1 MB 56 kB/s
     http_req_blocked...............: avg=7.39µs   min=0s       med=1µs      max=3.99ms   p(90)=2µs      p(95)=2µs     
     http_req_connecting............: avg=3.34µs   min=0s       med=0s       max=957µs    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=13.89ms  min=220µs    med=11.55ms  max=102.24ms p(90)=28.28ms  p(95)=34.38ms 
       { expected_response:true }...: avg=14.2ms   min=220µs    med=11.79ms  max=102.24ms p(90)=28.58ms  p(95)=34.49ms 
     http_req_failed................: 13.38% ✓ 1175       ✗ 7601
     http_req_receiving.............: avg=182.04µs min=5µs      med=31µs     max=81.84ms  p(90)=130µs    p(95)=153.24µs
     http_req_sending...............: avg=6.89µs   min=2µs      med=4µs      max=919µs    p(90)=8µs      p(95)=11µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=13.7ms   min=207µs    med=11.46ms  max=92.73ms  p(90)=28.17ms  p(95)=34.17ms 
     http_reqs......................: 8776   436.519014/s
     iteration_duration.............: avg=114.2ms  min=100.27ms med=111.88ms max=205.01ms p(90)=128.66ms p(95)=134.73ms
     iterations.....................: 8776   436.519014/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50